In [1]:
import numpy as np
import pandas as pd

In [2]:
#Importing dataset
data = pd.read_csv("C:\\Users\\siddh\\OneDrive\\Desktop\\Data science data\\titanic_train.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
#Need only age column for hypothesis testing
data = data[['Age']]
data.head()

    Age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [4]:
#Population data
pop_age = data['Age'].dropna()

In [5]:
#Total observation in population data
len(pop_age)

714

In [6]:
#Getting the sample of 25 observations from population data
sample_age = pop_age.sample(25).values

In [7]:
#sample data
sample_age

array([24. , 23. , 24. , 36. , 36. ,  9. , 22. , 19. , 22. , 21. , 16. ,
       52. , 50. , 37. , 47. , 28.5,  9. , 40. , 33. , 54. , 60. , 22. ,
       15. , 29. , 40. ])

In [8]:
# HYPOTHESIS

# H0 --> The mean age is 40
# H1 --> The mean age is less than 40

In [9]:
#Checking for normality in shapiro wilk test

from scipy.stats import shapiro

shapiro_age = shapiro(sample_age)
print(shapiro_age)

ShapiroResult(statistic=0.9543580412864685, pvalue=0.31356123089790344)

In [15]:
# performing t-test

from scipy.stats import ttest_1samp

t_calc , p_value = ttest_1samp(sample_age,40,alternative='less')  #Left tail test

print("t-calc :",t_calc)
print("p-value :",p_value)
print()


# alpha = 5%

if p_value < 0.05 :
    print("We reject null hypothesis")
    
else:
    print("We are failing to reject null hypothesis")

t-calc : -3.2784975108424415
p-value : 0.0015870153048303415

We reject null hypothesis

In [16]:
# conclusion -  Mean age is less than 40

In [17]:
# verifying result
np.mean(pop_age)

29.69911764705882